Revit 2024 API
MacroLevel Enumeration
 The Macro levels.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum MacroLevel
Visual Basic
Public Enumeration MacroLevel
Visual C++
public enum class MacroLevel
Members
Member name | Description
Application |  The application Macro.
Document |  The document Macro.
See Also
Autodesk.Revit.DB.Macros Namespace